[
  {
    "title": " Java Programming",
    "description": "Java is a general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible.",
    "author": " James Gosling",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 49
  },
  {
    "title": " Python Programming",
    "description": "Python is an interpreted high-level general-purpose programming language. Python's design philosophy emphasizes code readability with its notable use of significant indentation.",
    "author": " Guido van Rossum",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 50
  },
  {
    "title": " C Programming",
    "description": "C is a general-purpose, procedural computer programming language supporting structured programming, lexical variable scope, and recursion, with a static type system.",
    "author": " Dennis Ritchie",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 51
  },
  {
    "title": " C++ Programming",
    "description": "C++ is a general-purpose programming language created by Bjarne Stroustrup as an extension of the C programming language, or 'C with Classes'.",
    "author": " Bjarne Stroustrup",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 52
  },
  {
    "title": " JavaScript Programming",
    "description": "JavaScript, often abbreviated as JS, is a programming language that conforms to the ECMAScript specification.",
    "author": " Brendan Eich",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 53
  },
  {
    "title": " Ruby Programming",
    "description": "Ruby is an interpreted, high-level, general-purpose programming language. It was designed and developed in the mid-1990s by Yukihiro 'Matz' Matsumoto in Japan.",
    "author": " Yukihiro Matsumoto",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 54
  },
  {
    "title": " PHP Programming",
    "description": "PHP is a general-purpose scripting language geared towards web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1994.",
    "author": " Rasmus Lerdorf",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 55
  },
  {
    "title": " Swift Programming",
    "description": "Swift is a general-purpose, multi-paradigm, compiled programming language developed by Apple Inc. and the open-source community, first released in 2014.",
    "author": " Chris Lattner",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 56
  },
  {
    "title": " Kotlin Programming",
    "description": "Kotlin is a cross-platform, statically typed, general-purpose programming language with type inference. Kotlin is designed to interoperate fully with Java.",
    "author": " JetBrains",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 57
  },
  {
    "title": " Go Programming",
    "description": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. Go is syntactically similar to C.",
    "author": " Google",
    "created_at": "2021-06-01T00:00:00.000Z",
    "courseId": 58
  }
]
